#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-ruwwi8p9TPLiH7cP

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=39185d6235fae871ead76eeea9b7485968aa1567]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=x3fdqk]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=uq9zi6]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.dynamoDB_login_prod_table.aws_dynamodb_table.login_prod will be created
  + resource "aws_dynamodb_table" "login_prod" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "login-prod"
      + range_key        = "date"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 2

      + attribute {
          + name = "date"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }
      + attribute {
          + name = "userId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "userId"
          + name               = "ActiveSessionsIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "status"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

  # module.dynamoDB_login_test_table.aws_dynamodb_table.login_test will be created
  + resource "aws_dynamodb_table" "login_test" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "userId"
      + id               = (known after apply)
      + name             = "login-test"
      + range_key        = "date"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 2

      + attribute {
          + name = "date"
          + type = "S"
        }
      + attribute {
          + name = "status"
          + type = "S"
        }
      + attribute {
          + name = "userId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "userId"
          + name               = "ActiveSessionsIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "status"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*